app/controllers/articles_controller.rb

SELECT  `articles`.* FROM `articles` WHERE (title LIKE '%test%' OR content LIKE '%test%') ORDER BY `articles`.`date` DESC LIMIT 20
SELECT `comments`.* FROM `comments` WHERE `comments`.`article_id` IN (1, 2)
---
  def search
    @articles = Article.includes(:comments).order(date: :desc).where("title LIKE ? OR content LIKE ?", "%#{params[:keyword]}%", "%#{params[:keyword]}%").take(20)

INSERT INTO `articles` (`email`, `title`, `content`, `date`, `published`, `created_at`, `updated_at`) VALUES ('hamzafastian@gmail.com', 'hamza', 'test content', '2018-06-01 18:33:57', 1, '2018-06-01 18:44:36', '2018-06-01 18:44:36')
---
  def create
    @article = Article.new(article_params)

    if @article.save

UPDATE `articles` SET `title` = 'test title', `content` = 'updated content' WHERE `articles`.`id` = 4
---
  def update
    if @article.update(article_params)

DELETE FROM `articles` WHERE `articles`.`id` = 6
---
  def destroy
    @article.destroy

SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 6 LIMIT 1
---
  def set_article
    @article = Article.find(params[:id])